In [1]:
import pandas as pd,numpy as np

In [2]:
# Step 1:
df = pd.read_csv("titanic.csv")

In [3]:
df.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
df.tail(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0,0.0,0.0,315082,7.875,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
df.shape

(1310, 14)

In [6]:
# Step2:

In [7]:
df.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

In [9]:
df.dtypes

pclass       float64
survived     float64
name          object
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [10]:
# Step3:

In [11]:
df.isnull().sum()*100/len(df)

pclass        0.076336
survived      0.076336
name          0.076336
sex           0.076336
age          20.152672
sibsp         0.076336
parch         0.076336
ticket        0.076336
fare          0.152672
cabin        77.480916
embarked      0.229008
boat         62.900763
body         90.763359
home.dest    43.129771
dtype: float64

In [12]:
df.drop(['cabin','boat','body','home.dest'],axis = 1, inplace = True)

In [13]:
df.isnull().sum()*100/len(df)

pclass       0.076336
survived     0.076336
name         0.076336
sex          0.076336
age         20.152672
sibsp        0.076336
parch        0.076336
ticket       0.076336
fare         0.152672
embarked     0.229008
dtype: float64

In [14]:
df['embarked'].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

In [15]:
df['embarked'].fillna(df['embarked'].mode(),inplace = True)

In [16]:
df.isnull().sum()*100/len(df)

pclass       0.076336
survived     0.076336
name         0.076336
sex          0.076336
age         20.152672
sibsp        0.076336
parch        0.076336
ticket       0.076336
fare         0.152672
embarked     0.229008
dtype: float64

In [17]:
df['age'].fillna(df['age'].median(),inplace = True)

In [18]:
df.isnull().sum()*100/len(df)

pclass      0.076336
survived    0.076336
name        0.076336
sex         0.076336
age         0.000000
sibsp       0.076336
parch       0.076336
ticket      0.076336
fare        0.152672
embarked    0.229008
dtype: float64

In [19]:
df.dropna(inplace=True)

In [20]:
df.isnull().sum()*100/len(df)

pclass      0.0
survived    0.0
name        0.0
sex         0.0
age         0.0
sibsp       0.0
parch       0.0
ticket      0.0
fare        0.0
embarked    0.0
dtype: float64

In [21]:
df.shape

(1306, 10)

In [22]:
del df['name']

In [23]:
df.head()

   pclass  survived     sex      age  sibsp  parch  ticket      fare embarked
0     1.0       1.0  female  29.0000    0.0    0.0   24160  211.3375        S
1     1.0       1.0    male   0.9167    1.0    2.0  113781  151.5500        S
2     1.0       0.0  female   2.0000    1.0    2.0  113781  151.5500        S
3     1.0       0.0    male  30.0000    1.0    2.0  113781  151.5500        S
4     1.0       0.0  female  25.0000    1.0    2.0  113781  151.5500        S

In [24]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()

In [25]:
df['sex'] = label_encoder.fit_transform(df['sex'])

In [26]:
df['embarked'] = label_encoder.fit_transform(df['embarked'])

In [27]:
df.head()

   pclass  survived  sex      age  sibsp  parch  ticket      fare  embarked
0     1.0       1.0    0  29.0000    0.0    0.0   24160  211.3375         2
1     1.0       1.0    1   0.9167    1.0    2.0  113781  151.5500         2
2     1.0       0.0    0   2.0000    1.0    2.0  113781  151.5500         2
3     1.0       0.0    1  30.0000    1.0    2.0  113781  151.5500         2
4     1.0       0.0    0  25.0000    1.0    2.0  113781  151.5500         2

In [28]:
abs(df.corr())

,pclass,survived,sex,age,sibsp,parch,fare,embarked
pclass,1.000000,0.310064,0.121407,0.378305,0.060149,0.017596,0.557861,0.187027
survived,0.310064,1.000000,0.527248,0.045756,0.027228,0.083400,0.242960,0.176489
sex,0.121407,0.527248,1.000000,0.055929,0.110529,0.214179,0.184034,0.099090
age,0.378305,0.045756,0.055929,1.000000,0.188884,0.124578,0.177627,0.066432
sibsp,0.060149,0.027228,0.110529,0.188884,1.000000,0.373281,0.161030,0.066299
parch,0.017596,0.083400,0.214179,0.124578,0.373281,1.000000,0.222327,0.045438
fare,0.557861,0.242960,0.184034,0.177627,0.161030,0.222327,1.000000,0.239086
embarked,0.187027,0.176489,0.099090,0.066432,0.066299,0.045438,0.239086,1.000000

In [29]:
from sklearn.model_selection import train_test_split

In [30]:
df.head()

   pclass  survived  sex      age  sibsp  parch  ticket      fare  embarked
0     1.0       1.0    0  29.0000    0.0    0.0   24160  211.3375         2
1     1.0       1.0    1   0.9167    1.0    2.0  113781  151.5500         2
2     1.0       0.0    0   2.0000    1.0    2.0  113781  151.5500         2
3     1.0       0.0    1  30.0000    1.0    2.0  113781  151.5500         2
4     1.0       0.0    0  25.0000    1.0    2.0  113781  151.5500         2

In [31]:
del df['ticket']

In [32]:
y = df['survived']
X = df.drop('survived',1)

/var/folders/dq/452wvgp96nv2qcc3dn0dv8240000gn/T/ipykernel_1171/484089062.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  X = df.drop('survived',1)

In [33]:
X_train, X_test, y_train, y_test = train_test_split(X, y, train_size=0.8 , random_state=100)

In [34]:
from sklearn.linear_model import LogisticRegression

In [37]:
model = LogisticRegression()
fit1  = model.fit(X_train,y_train)
pred = fit1.predict(X_test)

In [40]:
pred

array([0., 1., 0., 0., 1., 0., 1., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0.,
       0., 0., 0., 0., 0., 1., 0., 1., 1., 0., 0., 0., 1., 0., 0., 0., 1.,
       0., 0., 1., 0., 0., 0., 0., 1., 0., 1., 0., 0., 0., 0., 1., 1., 1.,
       1., 0., 1., 0., 0., 1., 0., 1., 1., 0., 1., 1., 1., 1., 0., 1., 1.,
       0., 0., 0., 0., 1., 1., 1., 0., 0., 0., 0., 1., 0., 0., 1., 1., 0.,
       0., 0., 0., 0., 0., 1., 1., 1., 1., 0., 0., 1., 0., 0., 0., 0., 0.,
       1., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 1., 0., 1.,
       0., 1., 0., 0., 0., 0., 0., 1., 0., 1., 0., 0., 1., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 1.,
       0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 1., 0., 1., 0., 1., 1., 0.,
       0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 0., 0., 0., 0., 1., 0., 0.,
       0., 1., 1., 0., 1., 1., 0., 1., 0., 0., 1., 0., 1., 0., 1., 0., 0.,
       1., 0., 1., 0., 0., 0., 0., 1., 0., 1., 0., 0., 0., 0., 1., 0., 0.,
       1., 0., 0., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 1.,
       0., 0., 0., 0., 1., 1., 1., 1., 1., 0., 1., 0., 0., 1., 1., 1., 1.,
       0., 0., 1., 0., 0., 0., 0.])

In [41]:
pred_prob = fit1.predict_proba(X_test)

In [43]:
pred_prob[:,0]

array([0.94358758, 0.19402658, 0.80760995, 0.89342916, 0.24542268,
       0.851559  , 0.12681631, 0.79787892, 0.37210028, 0.85719937,
       0.74503676, 0.85704857, 0.72032989, 0.06608704, 0.82175682,
       0.86464314, 0.73457946, 0.86281301, 0.73242872, 0.81459366,
       0.87735994, 0.79460117, 0.41179967, 0.62996237, 0.37923564,
       0.37209333, 0.89977929, 0.54886747, 0.71279116, 0.17555665,
       0.8552473 , 0.87222399, 0.64283599, 0.28592639, 0.54911002,
       0.88743198, 0.1763015 , 0.83399587, 0.5322166 , 0.88608167,
       0.73330043, 0.13266446, 0.86621294, 0.3688741 , 0.92571473,
       0.8624231 , 0.66416816, 0.52465337, 0.17779633, 0.37203957,
       0.17028804, 0.46719698, 0.93805571, 0.37647323, 0.87455904,
       0.60641513, 0.43749656, 0.54734553, 0.0672002 , 0.05533526,
       0.73878191, 0.20044351, 0.34878205, 0.22223897, 0.38667061,
       0.75708387, 0.14779227, 0.37824633, 0.8463419 , 0.84028115,
       0.69071504, 0.87380143, 0.31710403, 0.24446747, 0.20099317,
       0.85931882, 0.87694776, 0.53768165, 0.88943603, 0.15971095,
       0.94172605, 0.83825989, 0.12732152, 0.47990584, 0.76147842,
       0.86255073, 0.84598545, 0.82925538, 0.77932392, 0.64795216,
       0.0579387 , 0.20503459, 0.49329237, 0.43520534, 0.90825842,
       0.58890274, 0.39622642, 0.87363522, 0.8775597 , 0.72684793,
       0.8548662 , 0.904408  , 0.23882768, 0.86281301, 0.83399587,
       0.13577943, 0.64293988, 0.85397235, 0.55951669, 0.73851986,
       0.75918547, 0.89384601, 0.55718986, 0.8535569 , 0.86999303,
       0.3144438 , 0.07996485, 0.85033272, 0.44293888, 0.8622522 ,
       0.37209333, 0.7796849 , 0.79144387, 0.66437836, 0.71695178,
       0.88734299, 0.05604401, 0.86281301, 0.11919901, 0.8029409 ,
       0.93112824, 0.42210441, 0.96184526, 0.87719775, 0.88708457,
       0.86624476, 0.8607742 , 0.86314941, 0.76147842, 0.67919964,
       0.86640374, 0.55542586, 0.87400943, 0.45218727, 0.09908399,
       0.93070593, 0.8712734 , 0.57238117, 0.89679477, 0.77113734,
       0.87365488, 0.88147875, 0.19225278, 0.89060146, 0.86281301,
       0.05911501, 0.67246779, 0.94448477, 0.85039505, 0.77409541,
       0.89659239, 0.5119495 , 0.8773216 , 0.07462371, 0.76805695,
       0.4181261 , 0.91096662, 0.37786692, 0.45673829, 0.89031845,
       0.81998149, 0.52085351, 0.88737044, 0.88734299, 0.8327333 ,
       0.54886747, 0.1796891 , 0.43490008, 0.07826535, 0.65488398,
       0.83399587, 0.62845293, 0.88737044, 0.56054713, 0.4560886 ,
       0.91120043, 0.86060279, 0.88748535, 0.10355708, 0.32348491,
       0.91097781, 0.22466234, 0.06603774, 0.98666561, 0.30480312,
       0.54491744, 0.87044771, 0.17162149, 0.70295441, 0.09393317,
       0.88737044, 0.10554733, 0.88722498, 0.60901014, 0.29526769,
       0.70947622, 0.42688363, 0.52887412, 0.83424437, 0.83344101,
       0.82196295, 0.45651459, 0.81263356, 0.28308366, 0.80505935,
       0.86281301, 0.8171986 , 0.80505935, 0.14932412, 0.75806517,
       0.50445595, 0.07900934, 0.61251587, 0.68228583, 0.68677451,
       0.88067357, 0.14160138, 0.93139981, 0.73112871, 0.73878191,
       0.07242107, 0.88748535, 0.84182617, 0.52378688, 0.54206447,
       0.90252501, 0.87331946, 0.10112891, 0.88734299, 0.91587635,
       0.89371073, 0.7529661 , 0.37206038, 0.06131154, 0.17062655,
       0.06147327, 0.47034204, 0.92999137, 0.28308366, 0.86151874,
       0.67601009, 0.43087632, 0.41908937, 0.321403  , 0.18079322,
       0.83131662, 0.89975921, 0.27625494, 0.92256544, 0.77979759,
       0.63589794, 0.87232321])

In [44]:
pred_prob[:,1]

array([0.05641242, 0.80597342, 0.19239005, 0.10657084, 0.75457732,
       0.148441  , 0.87318369, 0.20212108, 0.62789972, 0.14280063,
       0.25496324, 0.14295143, 0.27967011, 0.93391296, 0.17824318,
       0.13535686, 0.26542054, 0.13718699, 0.26757128, 0.18540634,
       0.12264006, 0.20539883, 0.58820033, 0.37003763, 0.62076436,
       0.62790667, 0.10022071, 0.45113253, 0.28720884, 0.82444335,
       0.1447527 , 0.12777601, 0.35716401, 0.71407361, 0.45088998,
       0.11256802, 0.8236985 , 0.16600413, 0.4677834 , 0.11391833,
       0.26669957, 0.86733554, 0.13378706, 0.6311259 , 0.07428527,
       0.1375769 , 0.33583184, 0.47534663, 0.82220367, 0.62796043,
       0.82971196, 0.53280302, 0.06194429, 0.62352677, 0.12544096,
       0.39358487, 0.56250344, 0.45265447, 0.9327998 , 0.94466474,
       0.26121809, 0.79955649, 0.65121795, 0.77776103, 0.61332939,
       0.24291613, 0.85220773, 0.62175367, 0.1536581 , 0.15971885,
       0.30928496, 0.12619857, 0.68289597, 0.75553253, 0.79900683,
       0.14068118, 0.12305224, 0.46231835, 0.11056397, 0.84028905,
       0.05827395, 0.16174011, 0.87267848, 0.52009416, 0.23852158,
       0.13744927, 0.15401455, 0.17074462, 0.22067608, 0.35204784,
       0.9420613 , 0.79496541, 0.50670763, 0.56479466, 0.09174158,
       0.41109726, 0.60377358, 0.12636478, 0.1224403 , 0.27315207,
       0.1451338 , 0.095592  , 0.76117232, 0.13718699, 0.16600413,
       0.86422057, 0.35706012, 0.14602765, 0.44048331, 0.26148014,
       0.24081453, 0.10615399, 0.44281014, 0.1464431 , 0.13000697,
       0.6855562 , 0.92003515, 0.14966728, 0.55706112, 0.1377478 ,
       0.62790667, 0.2203151 , 0.20855613, 0.33562164, 0.28304822,
       0.11265701, 0.94395599, 0.13718699, 0.88080099, 0.1970591 ,
       0.06887176, 0.57789559, 0.03815474, 0.12280225, 0.11291543,
       0.13375524, 0.1392258 , 0.13685059, 0.23852158, 0.32080036,
       0.13359626, 0.44457414, 0.12599057, 0.54781273, 0.90091601,
       0.06929407, 0.1287266 , 0.42761883, 0.10320523, 0.22886266,
       0.12634512, 0.11852125, 0.80774722, 0.10939854, 0.13718699,
       0.94088499, 0.32753221, 0.05551523, 0.14960495, 0.22590459,
       0.10340761, 0.4880505 , 0.1226784 , 0.92537629, 0.23194305,
       0.5818739 , 0.08903338, 0.62213308, 0.54326171, 0.10968155,
       0.18001851, 0.47914649, 0.11262956, 0.11265701, 0.1672667 ,
       0.45113253, 0.8203109 , 0.56509992, 0.92173465, 0.34511602,
       0.16600413, 0.37154707, 0.11262956, 0.43945287, 0.5439114 ,
       0.08879957, 0.13939721, 0.11251465, 0.89644292, 0.67651509,
       0.08902219, 0.77533766, 0.93396226, 0.01333439, 0.69519688,
       0.45508256, 0.12955229, 0.82837851, 0.29704559, 0.90606683,
       0.11262956, 0.89445267, 0.11277502, 0.39098986, 0.70473231,
       0.29052378, 0.57311637, 0.47112588, 0.16575563, 0.16655899,
       0.17803705, 0.54348541, 0.18736644, 0.71691634, 0.19494065,
       0.13718699, 0.1828014 , 0.19494065, 0.85067588, 0.24193483,
       0.49554405, 0.92099066, 0.38748413, 0.31771417, 0.31322549,
       0.11932643, 0.85839862, 0.06860019, 0.26887129, 0.26121809,
       0.92757893, 0.11251465, 0.15817383, 0.47621312, 0.45793553,
       0.09747499, 0.12668054, 0.89887109, 0.11265701, 0.08412365,
       0.10628927, 0.2470339 , 0.62793962, 0.93868846, 0.82937345,
       0.93852673, 0.52965796, 0.07000863, 0.71691634, 0.13848126,
       0.32398991, 0.56912368, 0.58091063, 0.678597  , 0.81920678,
       0.16868338, 0.10024079, 0.72374506, 0.07743456, 0.22020241,
       0.36410206, 0.12767679])